// step 1 //
Какая команда используется для вывода (печати) данных?
--- print() ---

// step 2 //
Выберите верные строки кода.
print("I'm a math teacher and a programmer!")
print()
print("3.1415")
print('Поэма "Мёртвые души" одна из самых интересных')

// step 3 //
Выберите верные строки кода.
print('Python', 'is the best', '!!')

// step 4 //
Что выведет следующий код print('1', '2', '3', '4', sep='*')?
--- 1*2*3*4 ---

// step 5 //
Выберите верные строки кода.
print("Told you not to worry", "But maybe that's a lie", sep=' :) ')
print("Honey, what's your hurry", end='?')
print("The world's a little blurry", "Or maybe it's my eyes", end='!!!', sep=' :) ')

// step 6 //
Какая команда используется для считывания данных с клавиатуры?
--- input() ---

// step 7 //
Какая из указанных строк считывает целое число в переменную n?
--- n = int(input()) ---

// step 8 //
Выберите верные утверждения.
--- Имя переменной может начинаться с символа подчёркивания (_)
Имя переменной не может совпадать с ключевым (зарезервированным) словом
Имя переменной не может начинаться с цифры ---

// step 9 //
Какое число выведет следующий код?
s = 13
k = -5
d = s + 2
s = d
k = 2 * s
print(s + k + d)
--- 60 ---

// step 10 //
Какое число выведет следующий код?
a = 17 // (23 % 7)
b = 34 % a * 5 - 29 % 4 * 3
print(a * b)
--- 56 ---