// step 1 //
Python является
--- интерпретируемым языком ---

// step 2 //
Преимуществами языка Python являются
--- платформонезависимость  ---
--- встраиваемость ---
--- простота ---
--- наличие большой библиотеки классов  ---
--- динамическая типизация (для несложных программ)  ---

// step 3 //
Недостатками языка Python являются
--- низкая скорость выполнения программ ---
--- динамическая типизация (для сложных программ) ---

// step 4 //
Какие задачи можно решать, используя язык Python?
--- cоздание графических приложений GUI ---
--- создание приложений анализа данных ---
--- создание веб-приложений ---
--- создание системных утилит ---
--- создание приложений баз данных ---